Number of Epochs:  200 
Batch Size:  128 
Learning Rate:  0.01

Model Setup:  
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1            [-1, 6, 28, 28]             456
         MaxPool2d-2            [-1, 6, 14, 14]               0
            Conv2d-3           [-1, 18, 10, 10]           2,718
         MaxPool2d-4             [-1, 18, 5, 5]               0
            Conv2d-5            [-1, 120, 1, 1]          54,120
            Linear-6                   [-1, 84]          10,164
            Linear-7                   [-1, 10]             850
================================================================
Total params: 68,308
Trainable params: 68,308
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 0.06
Params size (MB): 0.26
Estimated Total Size (MB): 0.34
----------------------------------------------------------------


CIFAR-10 Training:
----------------------------------------------------------------
Files already downloaded and verified
Files already downloaded and verified

Validation Loss:     2.9673740237574036
Validation Accuracy: 0.9375
----------------------------------------------------------------

Model Setup:  
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1            [-1, 2, 28, 28]             152
         MaxPool2d-2            [-1, 2, 14, 14]               0
            Conv2d-3            [-1, 6, 10, 10]             306
         MaxPool2d-4              [-1, 6, 5, 5]               0
            Conv2d-5             [-1, 40, 1, 1]           6,040
            Linear-6                   [-1, 84]           3,444
            Linear-7                   [-1, 10]             850
================================================================
Total params: 10,792
Trainable params: 10,792
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 0.02
Params size (MB): 0.04
Estimated Total Size (MB): 0.07
----------------------------------------------------------------


CIFAR-10 Training:
----------------------------------------------------------------
Files already downloaded and verified
Files already downloaded and verified

Validation Loss:     1.94266220889514
Validation Accuracy: 0.5
----------------------------------------------------------------


Expanded Model Dimensions:
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1            [-1, 2, 28, 28]             152
         MaxPool2d-2            [-1, 2, 14, 14]               0
            Conv2d-3            [-1, 6, 10, 10]             306
         MaxPool2d-4              [-1, 6, 5, 5]               0
            Conv2d-5             [-1, 80, 1, 1]          12,080
            Linear-6                   [-1, 84]           6,804
            Linear-7                   [-1, 10]             850
================================================================
Total params: 20,192
Trainable params: 20,192
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 0.02
Params size (MB): 0.08
Estimated Total Size (MB): 0.11
----------------------------------------------------------------


CIFAR-10 Training:
----------------------------------------------------------------
Files already downloaded and verified
Files already downloaded and verified

Validation Loss:     2.9026248364508906
Validation Accuracy: 0.5625
----------------------------------------------------------------


Expanded Model Dimensions:
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1            [-1, 2, 28, 28]             152
         MaxPool2d-2            [-1, 2, 14, 14]               0
            Conv2d-3            [-1, 6, 10, 10]             306
         MaxPool2d-4              [-1, 6, 5, 5]               0
            Conv2d-5            [-1, 120, 1, 1]          18,120
            Linear-6                   [-1, 84]          10,164
            Linear-7                   [-1, 10]             850
================================================================
Total params: 29,592
Trainable params: 29,592
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 0.02
Params size (MB): 0.11
Estimated Total Size (MB): 0.15
----------------------------------------------------------------


CIFAR-10 Training:
----------------------------------------------------------------
Files already downloaded and verified
Files already downloaded and verified

Validation Loss:     3.663782672037052
Validation Accuracy: 0.5625
----------------------------------------------------------------


Expanded Model Dimensions:
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1            [-1, 2, 28, 28]             152
         MaxPool2d-2            [-1, 2, 14, 14]               0
            Conv2d-3           [-1, 12, 10, 10]             612
         MaxPool2d-4             [-1, 12, 5, 5]               0
            Conv2d-5            [-1, 120, 1, 1]          36,120
            Linear-6                   [-1, 84]          10,164
            Linear-7                   [-1, 10]             850
================================================================
Total params: 47,898
Trainable params: 47,898
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 0.03
Params size (MB): 0.18
Estimated Total Size (MB): 0.22
----------------------------------------------------------------


CIFAR-10 Training:
----------------------------------------------------------------
Files already downloaded and verified
Files already downloaded and verified

Validation Loss:     4.415272296229495
Validation Accuracy: 0.5
----------------------------------------------------------------


Expanded Model Dimensions:
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1            [-1, 2, 28, 28]             152
         MaxPool2d-2            [-1, 2, 14, 14]               0
            Conv2d-3           [-1, 18, 10, 10]             918
         MaxPool2d-4             [-1, 18, 5, 5]               0
            Conv2d-5            [-1, 120, 1, 1]          54,120
            Linear-6                   [-1, 84]          10,164
            Linear-7                   [-1, 10]             850
================================================================
Total params: 66,204
Trainable params: 66,204
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 0.03
Params size (MB): 0.25
Estimated Total Size (MB): 0.30
----------------------------------------------------------------


CIFAR-10 Training:
----------------------------------------------------------------
Files already downloaded and verified
Files already downloaded and verified

Validation Loss:     3.7108419786525677
Validation Accuracy: 0.375
----------------------------------------------------------------


Expanded Model Dimensions:
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1            [-1, 4, 28, 28]             304
         MaxPool2d-2            [-1, 4, 14, 14]               0
            Conv2d-3           [-1, 18, 10, 10]           1,818
         MaxPool2d-4             [-1, 18, 5, 5]               0
            Conv2d-5            [-1, 120, 1, 1]          54,120
            Linear-6                   [-1, 84]          10,164
            Linear-7                   [-1, 10]             850
================================================================
Total params: 67,256
Trainable params: 67,256
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 0.05
Params size (MB): 0.26
Estimated Total Size (MB): 0.32
----------------------------------------------------------------


CIFAR-10 Training:
----------------------------------------------------------------
Files already downloaded and verified
Files already downloaded and verified

Validation Loss:     3.262804229048234
Validation Accuracy: 0.75
----------------------------------------------------------------


Expanded Model Dimensions:
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1            [-1, 6, 28, 28]             456
         MaxPool2d-2            [-1, 6, 14, 14]               0
            Conv2d-3           [-1, 18, 10, 10]           2,718
         MaxPool2d-4             [-1, 18, 5, 5]               0
            Conv2d-5            [-1, 120, 1, 1]          54,120
            Linear-6                   [-1, 84]          10,164
            Linear-7                   [-1, 10]             850
================================================================
Total params: 68,308
Trainable params: 68,308
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 0.06
Params size (MB): 0.26
Estimated Total Size (MB): 0.34
----------------------------------------------------------------


CIFAR-10 Training:
----------------------------------------------------------------
Files already downloaded and verified
Files already downloaded and verified

Validation Loss:     3.0268359425701674
Validation Accuracy: 0.5625
----------------------------------------------------------------

===============================
Baseline Results 
-------------------------------
Validation Loss:      2.9673740237574036
Validation Accuracy:  0.9375

Dynamic Results 
-------------------------------
Validation Loss:      3.0268359425701674
Validation Accuracy:  0.5625
===============================
--- The experiemtn took 6695.943448543549 seconds to run ---
