Number of Epochs:  700 
Batch Size:  128 
Learning Rate:  0.01

Model Setup:  
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1            [-1, 6, 28, 28]             456
         MaxPool2d-2            [-1, 6, 14, 14]               0
            Conv2d-3           [-1, 18, 10, 10]           2,718
         MaxPool2d-4             [-1, 18, 5, 5]               0
            Conv2d-5            [-1, 120, 1, 1]          54,120
            Linear-6                   [-1, 84]          10,164
            Linear-7                   [-1, 10]             850
================================================================
Total params: 68,308
Trainable params: 68,308
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 0.06
Params size (MB): 0.26
Estimated Total Size (MB): 0.34
----------------------------------------------------------------
Files already downloaded and verified
Files already downloaded and verified


CIFAR-10 Training:
----------------------------------------------------------------

Validation Loss:     2.8048863742924945
Validation Accuracy: 0.375
----------------------------------------------------------------

Model Setup:  
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1            [-1, 2, 28, 28]             152
         MaxPool2d-2            [-1, 2, 14, 14]               0
            Conv2d-3            [-1, 6, 10, 10]             306
         MaxPool2d-4              [-1, 6, 5, 5]               0
            Conv2d-5             [-1, 40, 1, 1]           6,040
            Linear-6                   [-1, 84]           3,444
            Linear-7                   [-1, 10]             850
================================================================
Total params: 10,792
Trainable params: 10,792
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 0.02
Params size (MB): 0.04
Estimated Total Size (MB): 0.07
----------------------------------------------------------------
Files already downloaded and verified
Files already downloaded and verified


CIFAR-10 Training:
----------------------------------------------------------------

Validation Loss:     1.5797253998020027
Validation Accuracy: 0.375
----------------------------------------------------------------
n_epochs =   80
n_epochs =   100
freeze_train_ratio =   0.8


CIFAR-10 Training:
----------------------------------------------------------------

Validation Loss:     2.1790227286423307
Validation Accuracy: 0.5
----------------------------------------------------------------


CIFAR-10 Training:
----------------------------------------------------------------

Validation Loss:     1.3970620647261414
Validation Accuracy: 0.375
----------------------------------------------------------------


Expanded Model Dimensions:
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1            [-1, 2, 28, 28]             152
         MaxPool2d-2            [-1, 2, 14, 14]               0
            Conv2d-3            [-1, 6, 10, 10]             306
         MaxPool2d-4              [-1, 6, 5, 5]               0
            Conv2d-5             [-1, 80, 1, 1]          12,080
            Linear-6                   [-1, 84]           6,804
            Linear-7                   [-1, 10]             850
================================================================
Total params: 20,192
Trainable params: 20,192
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 0.02
Params size (MB): 0.08
Estimated Total Size (MB): 0.11
----------------------------------------------------------------
n_epochs =   80
n_epochs =   100
freeze_train_ratio =   0.8


CIFAR-10 Training:
----------------------------------------------------------------

Validation Loss:     2.23580232149438
Validation Accuracy: 0.125
----------------------------------------------------------------


CIFAR-10 Training:
----------------------------------------------------------------

Validation Loss:     1.3882257040542891
Validation Accuracy: 0.625
----------------------------------------------------------------


Expanded Model Dimensions:
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1            [-1, 2, 28, 28]             152
         MaxPool2d-2            [-1, 2, 14, 14]               0
            Conv2d-3            [-1, 6, 10, 10]             306
         MaxPool2d-4              [-1, 6, 5, 5]               0
            Conv2d-5            [-1, 120, 1, 1]          18,120
            Linear-6                   [-1, 84]          10,164
            Linear-7                   [-1, 10]             850
================================================================
Total params: 29,592
Trainable params: 29,592
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 0.02
Params size (MB): 0.11
Estimated Total Size (MB): 0.15
----------------------------------------------------------------
n_epochs =   80
n_epochs =   100
freeze_train_ratio =   0.8


CIFAR-10 Training:
----------------------------------------------------------------

Validation Loss:     2.291984183878838
Validation Accuracy: 0.1875
----------------------------------------------------------------


CIFAR-10 Training:
----------------------------------------------------------------

Validation Loss:     1.3430015316492394
Validation Accuracy: 0.4375
----------------------------------------------------------------


Expanded Model Dimensions:
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1            [-1, 2, 28, 28]             152
         MaxPool2d-2            [-1, 2, 14, 14]               0
            Conv2d-3           [-1, 12, 10, 10]             612
         MaxPool2d-4             [-1, 12, 5, 5]               0
            Conv2d-5            [-1, 120, 1, 1]          36,120
            Linear-6                   [-1, 84]          10,164
            Linear-7                   [-1, 10]             850
================================================================
Total params: 47,898
Trainable params: 47,898
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 0.03
Params size (MB): 0.18
Estimated Total Size (MB): 0.22
----------------------------------------------------------------
n_epochs =   80
n_epochs =   100
freeze_train_ratio =   0.8


CIFAR-10 Training:
----------------------------------------------------------------

Validation Loss:     2.298733672009239
Validation Accuracy: 0.125
----------------------------------------------------------------


CIFAR-10 Training:
----------------------------------------------------------------

Validation Loss:     1.3461057219324233
Validation Accuracy: 0.5
----------------------------------------------------------------


Expanded Model Dimensions:
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1            [-1, 2, 28, 28]             152
         MaxPool2d-2            [-1, 2, 14, 14]               0
            Conv2d-3           [-1, 18, 10, 10]             918
         MaxPool2d-4             [-1, 18, 5, 5]               0
            Conv2d-5            [-1, 120, 1, 1]          54,120
            Linear-6                   [-1, 84]          10,164
            Linear-7                   [-1, 10]             850
================================================================
Total params: 66,204
Trainable params: 66,204
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 0.03
Params size (MB): 0.25
Estimated Total Size (MB): 0.30
----------------------------------------------------------------
n_epochs =   80
n_epochs =   100
freeze_train_ratio =   0.8


CIFAR-10 Training:
----------------------------------------------------------------

Validation Loss:     2.3008265585838994
Validation Accuracy: 0.125
----------------------------------------------------------------


CIFAR-10 Training:
----------------------------------------------------------------

Validation Loss:     1.295324349705177
Validation Accuracy: 0.375
----------------------------------------------------------------


Expanded Model Dimensions:
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1            [-1, 4, 28, 28]             304
         MaxPool2d-2            [-1, 4, 14, 14]               0
            Conv2d-3           [-1, 18, 10, 10]           1,818
         MaxPool2d-4             [-1, 18, 5, 5]               0
            Conv2d-5            [-1, 120, 1, 1]          54,120
            Linear-6                   [-1, 84]          10,164
            Linear-7                   [-1, 10]             850
================================================================
Total params: 67,256
Trainable params: 67,256
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 0.05
Params size (MB): 0.26
Estimated Total Size (MB): 0.32
----------------------------------------------------------------
n_epochs =   80
n_epochs =   100
freeze_train_ratio =   0.8


CIFAR-10 Training:
----------------------------------------------------------------

Validation Loss:     2.297953183137918
Validation Accuracy: 0.125
----------------------------------------------------------------


CIFAR-10 Training:
----------------------------------------------------------------

Validation Loss:     1.2446878824052932
Validation Accuracy: 0.9375
----------------------------------------------------------------


Expanded Model Dimensions:
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1            [-1, 6, 28, 28]             456
         MaxPool2d-2            [-1, 6, 14, 14]               0
            Conv2d-3           [-1, 18, 10, 10]           2,718
         MaxPool2d-4             [-1, 18, 5, 5]               0
            Conv2d-5            [-1, 120, 1, 1]          54,120
            Linear-6                   [-1, 84]          10,164
            Linear-7                   [-1, 10]             850
================================================================
Total params: 68,308
Trainable params: 68,308
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 0.06
Params size (MB): 0.26
Estimated Total Size (MB): 0.34
----------------------------------------------------------------

===============================
Baseline Results 
-------------------------------
Validation Loss:      2.8048863742924945
Validation Accuracy:  0.375

Dynamic Results 
-------------------------------
Validation Loss:      1.2446878824052932
Validation Accuracy:  0.9375
===============================
--- The experiment took 6009.133170127869 seconds to run ---
