Number of Epochs:  100 
Batch Size:  128 
Learning Rate:  0.01

Model Setup:  
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1            [-1, 6, 28, 28]             456
         MaxPool2d-2            [-1, 6, 14, 14]               0
            Conv2d-3           [-1, 18, 10, 10]           2,718
         MaxPool2d-4             [-1, 18, 5, 5]               0
            Conv2d-5            [-1, 120, 1, 1]          54,120
            Linear-6                   [-1, 84]          10,164
            Linear-7                   [-1, 10]             850
================================================================
Total params: 68,308
Trainable params: 68,308
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 0.06
Params size (MB): 0.26
Estimated Total Size (MB): 0.34
----------------------------------------------------------------
Files already downloaded and verified
Files already downloaded and verified


CIFAR-10 Training:
----------------------------------------------------------------

Validation Loss:     2.956883020038846
Validation Accuracy: 0.3125
----------------------------------------------------------------

Model Setup:  
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1            [-1, 2, 28, 28]             152
         MaxPool2d-2            [-1, 2, 14, 14]               0
            Conv2d-3            [-1, 6, 10, 10]             306
         MaxPool2d-4              [-1, 6, 5, 5]               0
            Conv2d-5             [-1, 40, 1, 1]           6,040
            Linear-6                   [-1, 84]           3,444
            Linear-7                   [-1, 10]             850
================================================================
Total params: 10,792
Trainable params: 10,792
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 0.02
Params size (MB): 0.04
Estimated Total Size (MB): 0.07
----------------------------------------------------------------
Files already downloaded and verified
Files already downloaded and verified


CIFAR-10 Training:
----------------------------------------------------------------

Validation Loss:     1.6072034518929976
Validation Accuracy: 0.5
----------------------------------------------------------------
n_epochs =   50
n_epochs =   100
freeze_train_ratio =   0.5


CIFAR-10 Training:
----------------------------------------------------------------

Validation Loss:     2.1762352170823496
Validation Accuracy: 0.4375
----------------------------------------------------------------


CIFAR-10 Training:
----------------------------------------------------------------

Validation Loss:     1.538804846473887
Validation Accuracy: 0.5625
----------------------------------------------------------------


Expanded Model Dimensions:
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1            [-1, 2, 28, 28]             152
         MaxPool2d-2            [-1, 2, 14, 14]               0
            Conv2d-3            [-1, 6, 10, 10]             306
         MaxPool2d-4              [-1, 6, 5, 5]               0
            Conv2d-5             [-1, 80, 1, 1]          12,080
            Linear-6                   [-1, 84]           6,804
            Linear-7                   [-1, 10]             850
================================================================
Total params: 20,192
Trainable params: 20,192
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 0.02
Params size (MB): 0.08
Estimated Total Size (MB): 0.11
----------------------------------------------------------------

===============================
Baseline Results 
-------------------------------
Validation Loss:      2.956883020038846
Validation Accuracy:  0.3125

Dynamic Results 
-------------------------------
Validation Loss:      1.538804846473887
Validation Accuracy:  0.5625
===============================
--- The experiment took 1227.8199489116669 seconds to run ---
