Number of Epochs:  700 
Batch Size:  128 
Learning Rate:  0.01

Model Setup:  
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1            [-1, 6, 28, 28]             456
         MaxPool2d-2            [-1, 6, 14, 14]               0
            Conv2d-3           [-1, 18, 10, 10]           2,718
         MaxPool2d-4             [-1, 18, 5, 5]               0
            Conv2d-5            [-1, 120, 1, 1]          54,120
            Linear-6                   [-1, 84]          10,164
            Linear-7                   [-1, 10]             850
================================================================
Total params: 68,308
Trainable params: 68,308
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 0.06
Params size (MB): 0.26
Estimated Total Size (MB): 0.34
----------------------------------------------------------------
Files already downloaded and verified
Files already downloaded and verified


CIFAR-10 Training:
----------------------------------------------------------------
